Repository: gemkids275/WritingToolsV2
Catalog: macOS/WritingTools/Localizable.xcstrings
Source language: en
Languages: de, es, fr, ja, vi, zh_hans

source: Input Monitoring is NOT required. AI Shortcuts only posts copy/paste commands.
de: Eine Eingabeüberwachung ist NICHT erforderlich. AI Shortcuts sendet nur Kopier-/Einfügebefehle.
es: No es necesario supervisar la entrada. AI Shortcuts solo publica comandos de copiar/pegar.
fr: La surveillance des entrées n'est PAS nécessaire. AI Shortcuts ne publie que des commandes copier/coller.
ja: 入力監視は必要ありません。AIショートカットはコピー＆ペーストコマンドのみを使用します。
vi: KHÔNG yêu cầu Theo dõi đầu vào (Input Monitoring). AI Shortcuts chỉ thực hiện các lệnh sao chép/dán.
zh_hans: 不需要“输入监视”。AI Shortcuts 仅执行复制/粘贴命令。

source: Interface Language:
de: Schnittstellensprache:
es: Idioma de la interfaz:
fr: Langue de l'interface :
ja: インターフェース言語:
vi: Ngôn ngữ giao diện:
zh_hans: 界面语言:

source: Keep Alive
de: Am Leben erhalten
es: Mantener activo
fr: Maintenir actif
ja: キープアライブ
vi: Duy trì kết nối
zh_hans: 保持连接

source: Keep Alive Time (e.g., 5m, 1h)
de: Verweildauer (z. B. 5 m, 1 h)
es: Tiempo de mantenimiento activo (por ejemplo, 5m, 1h)
fr: Durée de maintien actif (par exemple, 5m, 1h)
ja: キープアライブ時間（例：5m、1h）
vi: Thời gian duy trì kết nối (vd: 5m, 1h)
zh_hans: 保持连接时间（如 5m、1h）

source: Keep your command list in sync across your signed-in Apple devices.
de: Halten Sie Ihre Befehlsliste auf allen angemeldeten Apple-Geräten synchron.
es: Mantén tu lista de comandos sincronizada en todos tus dispositivos Apple con sesión iniciada.
fr: Gardez votre liste de commandes synchronisée sur tous vos appareils Apple connectés.
ja: サインイン済みの Apple デバイス間でコマンドリストを同期します。
vi: Giữ danh sách lệnh đồng bộ trên tất cả thiết bị Apple đã đăng nhập.
zh_hans: 在您登录的 Apple 设备之间同步命令列表。

source: Key Points
de: Schlüsselpunkte
es: Puntos clave
fr: Points clés
ja: 要点
vi: Ý chính
zh_hans: 关键点 (Key Points)

source: Keyboard Shortcuts
de: Tastenkombinationen
es: Atajos de teclado
fr: Raccourcis clavier
ja: キーボードショートカット
vi: Phím tắt bàn phím
zh_hans: 键盘快捷键

source: Language
de: Sprache
es: Idioma
fr: Langue
ja: 言語
vi: Ngôn ngữ
zh_hans: 语言

source: Language Preservation
de: Spracherhaltung
es: Preservación del idioma
fr: Préservation de la langue
ja: 言語の保持
vi: Bảo toàn ngôn ngữ
zh_hans: 语言保留

source: Later
de: Später
es: Más tarde
fr: Plus tard
ja: 後で
vi: Để sau
zh_hans: 稍后

source: Leave empty to use the default model for the selected provider. Examples: gpt-5-mini (OpenAI), claude-sonnet-4-5 (Anthropic), gemini-flash-latest (Gemini)
de: Leer lassen, um das Standardmodell für den ausgewählten Anbieter zu verwenden. Beispiele: gpt-5-mini (OpenAI), claude-sonnet-4-5 (Anthropic), gemini-flash-latest (Gemini)
es: Dejar vacío para usar el modelo predeterminado del proveedor seleccionado. Ejemplos: gpt-5-mini (OpenAI), claude-sonnet-4-5 (Anthropic), gemini-flash-latest (Gemini)
fr: Laisser vide pour utiliser le modèle par défaut du fournisseur sélectionné. Exemples : gpt-5-mini (OpenAI), claude-sonnet-4-5 (Anthropic), gemini-flash-latest (Gemini)
ja: 空にすると選択したプロバイダーのデフォルトモデルを使用します。例：gpt-5-mini（OpenAI）、claude-sonnet-4-5（Anthropic）、gemini-flash-latest（Gemini）
vi: Để trống để dùng mô hình mặc định. Ví dụ: gpt-5-mini (OpenAI), claude-sonnet-4-5 (Anthropic), gemini-flash-latest (Gemini)
zh_hans: 留空则使用所选提供商的默认模型。示例：gpt-5-mini（OpenAI）、claude-sonnet-4-5（Anthropic）、gemini-flash-latest（Gemini）

source: Link unavailable
de: Link nicht verfügbar
es: Enlace no disponible
fr: Lien indisponible
ja: リンク利用不可
vi: Liên kết không khả dụng
zh_hans: 链接不可用

source: Loading %@...
de: %@ wird geladen…
es: Cargando %@...
fr: Chargement de %@...
ja: %@を読み込み中...
vi: Đang tải %@...
zh_hans: 正在加载%@...

source: Loading model
de: Modell wird geladen
es: Cargando modelo
fr: Chargement du modèle
ja: モデルを読み込み中
vi: Đang tải mô hình
zh_hans: 正在加载模型

source: Local LLM
de: Lokale LLM
es: LLM local
ja: ローカル LLM
vi: LLM cục bộ
zh_hans: 本地 LLM

source: Local LLM (Llama 3.2 3b)
de: Lokale LLM (Llama 3.2 3b)
es: LLM local (Llama 3.2 3b)
ja: ローカル LLM（Llama 3.2 3b）
vi: LLM cục bộ (Llama 3.2 3b)
zh_hans: 本地 LLM（Llama 3.2 3b）

source: Local LLM (Llama 3.2)
de: Lokale LLM (Llama 3.2)
es: LLM local (Llama 3.2 3b)
ja: ローカル LLM（Llama 3.2）
vi: LLM cục bộ (Llama 3.2)
zh_hans: 本地 LLM（Llama 3.2）

source: Local LLM keeps data on‑device; cloud providers receive selected content for processing.
de: Lokale LLM speichert Daten auf dem Gerät; Cloud-Anbieter erhalten ausgewählte Inhalte zur Verarbeitung.
es: LLM local almacena los datos en el dispositivo; los proveedores de servicios en la nube reciben contenido seleccionado para su procesamiento.
fr: Le LLM local conserve les données sur l'appareil ; les fournisseurs de cloud reçoivent du contenu sélectionné pour le traitement.
ja: ローカル LLM はデータをデバイス上に保持します。クラウドプロバイダーは処理のために選択したコンテンツを受信します。
vi: LLM cục bộ giữ dữ liệu trên thiết bị; nhà cung cấp đám mây nhận nội dung đã chọn để xử lý.
zh_hans: 本地 LLM 将数据保留在设备上；云端提供商会接收选中内容进行处理。

source: Local LLM processing is only available on Apple Silicon (M-series) devices. Please select a different AI Provider.
de: Die lokale LLM-Verarbeitung ist nur auf Apple Silicon (M-Serie) Geräten verfügbar. Bitte wählen Sie einen anderen KI-Anbieter.
es: El procesamiento LLM local solo está disponible en dispositivos Apple Silicon (serie M). Por favor, selecciona un proveedor de IA diferente.
fr: Le traitement LLM local n'est disponible que sur les appareils Apple Silicon (série M). Veuillez sélectionner un autre fournisseur d'IA.
ja: ローカル LLM 処理は Apple Silicon（M シリーズ）デバイスのみで利用可能です。別の AI プロバイダーを選択してください。
vi: Xử lý LLM cục bộ chỉ khả dụng trên thiết bị Apple Silicon (dòng M). Vui lòng chọn nhà cung cấp AI khác.
zh_hans: 本地 LLM 处理仅适用于 Apple Silicon（M 系列）设备。请选择其他 AI 提供商。

source: Local LLMs: use the instructions on
de: Lokale LLMs: Verwenden Sie die Anweisungen auf
es: LLM locales: utilice las instrucciones de
fr: LLM locaux : utilisez les instructions sur
ja: ローカルLLM：以下の手順を参照してください
vi: LLM cục bộ: sử dụng hướng dẫn tại
zh_hans: 本地LLM：请参阅以下说明

source: macOS version by Arya Mirsepasi
de: macOS-Version von Arya Mirsepasi
es: Versión macOS de Arya Mirsepasi
fr: Version macOS par Arya Mirsepasi
ja: macOS 版 by Arya Mirsepasi
vi: Phiên bản macOS bởi Arya Mirsepasi
zh_hans: macOS 版本 by Arya Mirsepasi

source: Main
de: Haupt
es: Principal
fr: Principal
ja: メイン
vi: Chính
zh_hans: 主要

source: Maintain the original text formatting (line breaks, spacing, etc.)
de: Behalten Sie die ursprüngliche Textformatierung bei (Zeilenumbrüche, Abstände usw.).
es: Mantenga el formato original del texto (saltos de línea, espaciado, etc.).
fr: Conserver la mise en forme originale du texte (sauts de ligne, espacement, etc.)
ja: 元のテキスト書式（改行、スペースなど）を維持します
vi: Giữ nguyên định dạng văn bản gốc (xuống dòng, khoảng cách, v.v.)
zh_hans: 保持原始文本格式（换行、间距等）

source: Makes the response text larger
de: Macht den Antworttext größer
es: Hace el texto de respuesta más grande
fr: Agrandit le texte de réponse
ja: 返答テキストを大きくします
vi: Phóng to văn bản phản hồi
zh_hans: 增大响应文字

source: Makes the response text smaller
de: Macht den Antworttext kleiner
es: Hace el texto de respuesta más pequeño
fr: Réduit le texte de réponse
ja: 返答テキストを小さくします
vi: Thu nhỏ văn bản phản hồi
zh_hans: 缩小响应文字

source: Manage Commands
de: Befehle Verwalten
es: Gestionar comandos
fr: Gérer les commandes
ja: コマンドを管理
vi: Quản lý lệnh
zh_hans: 管理任务

source: Manage your writing tools and assign keyboard shortcuts.
de: Verwalten Sie Ihre Schreibwerkzeuge und weisen Sie Tastenkombinationen zu.
es: Gestiona tus herramientas de escritura y asigna atajos de teclado.
fr: Gérez vos outils d'écriture et attribuez des raccourcis clavier.
ja: ライティングツールを管理し、ショートカットを割り当てます。
vi: Quản lý công cụ viết của bạn và gán phím tắt.
zh_hans: 管理您的写作工具并分配快捷键。

source: Max Length:
de: Maximale Länge:
es: Longitud máxima:
fr: Longueur maximale:
ja: 最大長:
vi: Độ dài tối đa:
zh_hans: 最大长度：

source: Message to return when text is incompatible with request
de: Nachricht zurückgeben, wenn Text mit Anforderung inkompatibel ist
es: Mensaje a devolver cuando el texto es incompatible con la solicitud
fr: Message à renvoyer lorsque le texte est incompatible avec la demande
ja: テキストがリクエストと互換性がない場合に返すメッセージ
vi: Thông báo trả về khi văn bản không phù hợp với yêu cầu
zh_hans: 文本与请求不兼容时返回的消息

source: Min Length:
de: Minimale Länge:
es: Longitud mínima:
fr: Longueur minimale:
ja: 最小長:
vi: Độ dài tối thiểu:
zh_hans: 最小长度：

source: Mistral API key is required.
de: Mistral API-Schlüssel ist erforderlich.
es: Se requiere la clave API de Mistral.
fr: La clé API Mistral est requise.
ja: Mistral APIキーが必要です。
vi: Yêu cầu API key Mistral.
zh_hans: 需要 Mistral API 密钥。

source: Mistral model is required.
de: Mistral-Modell ist erforderlich.
es: Se requiere el modelo de Mistral.
fr: Le modèle Mistral est requis.
ja: Mistralモデルが必要です。
vi: Yêu cầu mô hình Mistral.
zh_hans: 需要 Mistral 模型。

source: Model Configuration
de: Modellkonfiguration
es: Configuración del modelo
fr: Configuration du modèle
ja: モデル設定
vi: Cấu hình mô hình
zh_hans: 模型配置

source: Model is required.
de: Modell ist erforderlich.
es: Se requiere el modelo.
fr: Le modèle est requis.
ja: モデルが必要です。
vi: Yêu cầu mô hình.
zh_hans: 需要模型。

source: Model Selection
de: Modellauswahl
es: Selección de modelos
fr: Sélection du modèle
ja: モデル選択
vi: Lựa chọn Model
zh_hans: 模型选择

source: Model:
de: Modell:
es: Modelo:
fr: Modèle :
ja: モデル:
vi: Mẫu model:
zh_hans: 模型：

source: Most changes apply automatically. Click Done to apply API key updates.
de: Die meisten Änderungen werden automatisch übernommen. Klicken Sie auf "Fertig", um API-Schlüssel-Aktualisierungen anzuwenden.
es: La mayoría de los cambios se aplican automáticamente. Haz clic en Listo para aplicar las actualizaciones de la clave API.
fr: La plupart des modifications s'appliquent automatiquement. Cliquez sur Terminé pour appliquer les mises à jour de la clé API.
ja: ほとんどの変更は自動的に適用されます。完了をクリックしてAPIキーの更新を反映してください。
vi: Hầu hết các thay đổi sẽ tự động được áp dụng. Nhấn Xong để cập nhập mã API.
zh_hans: 大多数更改将自动应用。点击“完成”以应用 API 密钥更新。

source: Next
de: Weiter
es: Siguiente
fr: Suivant
ja: 次へ
vi: Tiếp tục
zh_hans: 下一步

source: No built-in commands
de: Keine integrierten Befehle
es: No hay comandos integrados
fr: Pas de commandes intégrées
ja: 組み込みコマンドがありません
vi: Không có lệnh tích hợp
zh_hans: 无内置命令

source: No custom commands yet
de: Noch keine benutzerdefinierten Befehle
es: Aún no hay comandos personalizados
fr: Pas encore de commandes personnalisées
ja: カスタムコマンドはまだありません
vi: Chưa có lệnh tùy chỉnh
zh_hans: 暂无自定义命令

source: No icons found
de: Keine Symbole gefunden
es: No se encontraron iconos
fr: Aucune icône trouvée
ja: アイコンが見つかりません
vi: Không tìm thấy biểu tượng
zh_hans: 未找到图标

source: None Selected
de: Keine ausgewählt
es: Ninguno Seleccionado
fr: Aucune sélection
ja: 未選択
vi: Chưa chọn
zh_hans: 未选择

source: Not checked yet.
de: Noch nicht überprüft.
es: Aún no verificado.
fr: Pas encore vérifié.
ja: まだ確認されていません。
vi: Chưa kiểm tra.
zh_hans: 尚未检查。

source: Notes
de: Anmerkungen
es: Notas
ja: メモ
vi: Ghi chú
zh_hans: 备注

source: Ollama (Self-Hosted)
de: Ollama (Selbstgehostet)
es: Ollama (autoalojado)
fr: Ollama (auto-hébergé)
ja: Ollama（セルフホスト）
vi: Ollama (Tự lưu trữ)
zh_hans: Ollama（自托管）

source: Ollama Base URL
de: Ollama Basis-URL
es: URL de la base de Ollama
fr: URL de base Ollama
ja: Ollama ベース URL
vi: URL cơ sở Ollama
zh_hans: Ollama 基础 URL

source: Ollama base URL is required.
de: Ollama Basis-URL ist erforderlich.
es: La URL base de Ollama es obligatoria.
fr: L'URL de base d'Ollama est requise.
ja: Ollama ベース URLが必要です。
vi: Yêu cầu URL cơ sở Ollama.
zh_hans: 需要 Ollama 基础 URL。

source: Ollama Docs
de: Ollama-Dokumentation
es: Documentación de Ollama
fr: Documentation Ollama
ja: Ollamaドキュメント
vi: Tài liệu Ollama
zh_hans: Ollama文档

source: Ollama Documentation
de: Ollama-Dokumentation
es: Documentación de Ollama
fr: Documentation Ollama
ja: Ollama ドキュメント
vi: Tài liệu Ollama
zh_hans: Ollama 文档

source: Ollama model is required.
de: Ollama-Modell ist erforderlich.
es: Se requiere el modelo de Ollama.
fr: Le modèle Ollama est requis.
ja: Ollamaモデルが必要です。
vi: Yêu cầu mô hình Ollama.
zh_hans: 需要 Ollama 模型。

source: Ollama Model Name
de: Ollama Modell Name
es: Nombre del modelo Ollama
fr: Ollama Nom du modèle
ja: Ollama モデル名
vi: Tên mô hình Ollama
zh_hans: Ollama 模型名称

source: Open Anthropic console to create or view your API key.
de: Öffnen Sie die Anthropic-Konsole, um Ihren API-Schlüssel zu erstellen oder anzuzeigen.
es: Abre la consola de Anthropic para crear o ver tu clave API.
fr: Ouvrez la console Anthropic pour créer ou afficher votre clé API.
ja: Anthropic コンソールを開いて API キーを作成または確認します。
vi: Mở bảng điều khiển Anthropic để tạo hoặc xem API key.
zh_hans: 打开 Anthropic 控制台以创建或查看您的 API 密钥。

source: Open Commands Manager
de: Befehlsmanager öffnen
es: Abrir el Administrador de comandos
fr: Gestionnaire de commandes ouvertes
ja: コマンドマネージャーを開く
vi: Mở trình quản lý lệnh
zh_hans: 打开命令管理器

source: Open custom prompts in response window
de: Benutzerdefinierte Eingabeaufforderungen im Antwortfenster öffnen
es: Abre indicadores personalizados en la ventana de respuesta
fr: Ouvrir les invites personnalisées dans la fenêtre de réponse
ja: カスタムプロンプトを応答ウィンドウで開く
vi: Mở lệnh tùy chỉnh trong cửa sổ phản hồi
zh_hans: 在响应窗口中打开自定义命令

source: Open editor for this command
de: Editor für diesen Befehl öffnen
es: Abrir editor para este comando
fr: Ouvrir l'éditeur pour cette commande
ja: このコマンドのエディターを開く
vi: Mở trình chỉnh sửa cho lệnh này
zh_hans: 打开此命令的编辑器

source: Open Google AI Studio to generate an API key.
de: Öffnen Sie Google AI Studio, um einen API-Schlüssel zu generieren.
es: Abre Google AI Studio para generar una clave API.
fr: Ouvrez Google AI Studio pour générer une clé API.
ja: Google AI Studio を開いて API キーを生成します。
vi: Mở Google AI Studio để tạo API key.
zh_hans: 打开 Google AI Studio 以生成 API 密钥。

source: Open Mistral console to create an API key.
de: Öffnen Sie die Mistral-Konsole, um einen API-Schlüssel zu erstellen.
es: Abre la consola de Mistral para crear una clave API.
fr: Ouvrez la console Mistral pour créer une clé API.
ja: Mistral コンソールを開いて API キーを作成します。
vi: Mở bảng điều khiển Mistral để tạo API key.
zh_hans: 打开 Mistral 控制台以创建 API 密钥。

source: Open Ollama download and documentation page.
de: Ollama Download- und Dokumentationsseite öffnen.
es: Abrir la página de descarga y documentación de Ollama.
fr: Ouvrir la page de téléchargement et de documentation d'Ollama.
ja: Ollama のダウンロードとドキュメントページを開きます。
vi: Mở trang tải xuống và tài liệu Ollama.
zh_hans: 打开 Ollama 下载和文档页面。

source: Open OpenAI dashboard to create an API key.
de: Öffnen Sie das OpenAI-Dashboard, um einen API-Schlüssel zu erstellen.
es: Abre el panel de control de OpenAI para crear una clave API.
fr: Ouvrez le tableau de bord OpenAI pour créer une clé API.
ja: OpenAI ダッシュボードを開いて API キーを作成します。
vi: Mở bảng điều khiển OpenAI để tạo API key.
zh_hans: 打开 OpenAI 控制台以创建 API 密钥。

source: Open OpenRouter to retrieve your API key.
de: Öffnen Sie OpenRouter, um Ihren API-Schlüssel abzurufen.
es: Abre OpenRouter para recuperar tu clave API.
fr: Ouvrez OpenRouter pour récupérer votre clé API.
ja: OpenRouter を開いて API キーを取得します。
vi: Mở OpenRouter để lấy API key.
zh_hans: 打开 OpenRouter 以获取您的 API 密钥。

source: Open Privacy & Security
de: Datenschutz und Sicherheit öffnen
es: Abrir Privacidad y seguridad
fr: Confidentialité et sécurité ouvertes
ja: 「プライバシーとセキュリティ」を開く
vi: Mở Quyền riêng tư & Bảo mật
zh_hans: 打开隐私与安全性

source: Open Privacy and Security settings
de: Datenschutz- und Sicherheitseinstellungen öffnen
es: Abrir configuración de privacidad y seguridad
fr: Ouvrir les paramètres de confidentialité et sécurité
ja: プライバシーとセキュリティの設定を開く
vi: Mở cài đặt Quyền riêng tư & Bảo mật
zh_hans: 打开隐私与安全设置

source: Open System Settings to manage permissions.
de: Öffnen Sie die Systemeinstellungen, um Berechtigungen zu verwalten.
es: Abre la Configuración del sistema para gestionar los permisos.
fr: Ouvrez les paramètres système pour gérer les autorisations.
ja: システム設定を開いて権限を管理します。
vi: Mở Cài đặt hệ thống để quản lý quyền.
zh_hans: 打开系统设置以管理权限。

source: Open the Commands Manager to add, edit, or remove commands.
de: Öffnen Sie den Befehls-Manager, um Befehle hinzuzufügen, zu bearbeiten oder zu entfernen.
es: Abre el Administrador de comandos para agregar, editar o eliminar comandos.
fr: Ouvrez le gestionnaire de commandes pour ajouter, modifier ou supprimer des commandes.
ja: コマンドマネージャーを開いてコマンドを追加、編集、または削除します。
vi: Mở trình quản lý lệnh để thêm, sửa hoặc xóa lệnh.
zh_hans: 打开命令管理器以添加、编辑或删除命令。

source: Open the editor to customize the AI's behavior for manual inputs.
de: Editor öffnen, um das KI-Verhalten für manuelle Eingaben anzupassen.
es: Abre el editor para personalizar el comportamiento de la IA en las entradas manuales.
fr: Ouvrez l'éditeur pour personnaliser le comportement de l'IA pour les saisies manuelles.
ja: 手動入力に対するAIの動作をカスタマイズするエディターを開きます。
vi: Mở trình chỉnh sửa để tùy chỉnh hành vi AI cho đầu vào thủ công.
zh_hans: 打开编辑器以自定义 AI 对手动输入的行为。

source: Open the folder where local models are stored.
de: Den Ordner öffnen, in dem lokale Modelle gespeichert sind.
es: Abrir la carpeta donde se almacenan los modelos locales.
fr: Ouvrir le dossier où les modèles locaux sont stockés.
ja: ローカルモデルが保存されているフォルダーを開きます。
vi: Mở thư mục lưu trữ mô hình cục bộ.
zh_hans: 打开本地模型的存储文件夹。

source: Open the onboarding window to review permissions and setup.
de: Das Onboarding-Fenster öffnen, um Berechtigungen und Einrichtung zu überprüfen.
es: Abrir la ventana de incorporación para revisar permisos y configuración.
fr: Ouvrir la fenêtre d'intégration pour vérifier les autorisations et la configuration.
ja: オンボーディングウィンドウを開いて権限と設定を確認します。
vi: Mở cửa sổ khởi động để xem lại quyền và cài đặt.
zh_hans: 打开引导窗口以检查权限和设置。

source: Open the onboarding window to set up AI Shortcuts again.
de: Öffnen Sie das Onboarding-Fenster, um AI Shortcuts erneut einzurichten.
es: Abre la ventana de incorporación para configurar AI Shortcuts de nuevo.
fr: Ouvrez la fenêtre d'intégration pour configurer AI Shortcuts à nouveau.
ja: AI Shortcuts を再設定するためにオンボーディングウィンドウを開きます。
vi: Mở cửa sổ khởi động để cài đặt lại AI Shortcuts.
zh_hans: 再次打开引导窗口以设置 AI Shortcuts。

source: OpenAI API key is required.
de: OpenAI API-Schlüssel ist erforderlich.
es: Se requiere la clave API de OpenAI.
fr: La clé API OpenAI est requise.
ja: OpenAI APIキーが必要です。
vi: Yêu cầu API key OpenAI.
zh_hans: 需要 OpenAI API 密钥。

source: OpenAI model is required.
de: OpenAI-Modell ist erforderlich.
es: Se requiere el modelo de OpenAI.
fr: Le modèle OpenAI est requis.
ja: OpenAIモデルが必要です。
vi: Yêu cầu mô hình OpenAI.
zh_hans: 需要 OpenAI 模型。

source: OpenAI models include: gpt-4o, gpt-4o-mini, etc.
de: OpenAI-Modelle wie: gpt-4o, gpt-4o-mini, etc.
es: Los modelos OpenAI incluyen: gpt-4o, gpt-4o-mini, etc.
fr: Les modèles OpenAI incluent : gpt-4o, gpt-4o-mini, etc.
ja: OpenAI のモデル：gpt-4o、gpt-4o-mini など。
vi: Các mô hình OpenAI bao gồm: gpt-4o, gpt-4o-mini, v.v.
zh_hans: OpenAI 模型包括：gpt-4o、gpt-4o-mini 等。

source: OpenRouter API key is required.
de: OpenRouter API-Schlüssel ist erforderlich.
es: Se requiere la clave API de OpenRouter.
fr: La clé API OpenRouter est requise.
ja: OpenRouter APIキーが必要です。
vi: Yêu cầu API key OpenRouter.
zh_hans: 需要 OpenRouter API 密钥。

source: Optional: Override the global API key for this command. Leave empty to use default.
de: Optional: Globalen API-Schlüssel für diesen Befehl überschreiben. Leer lassen für Standard.
es: Opcional: anula la clave API global para este comando. Déjalo vacío para usar la predeterminada.
fr: Facultatif : remplacer la clé API globale pour cette commande. Laisser vide pour la valeur par défaut.
ja: オプション：このコマンドのグローバルAPIキーを上書き。デフォルトを使用する場合は空にしてください。
vi: Tùy chọn: Ghi đè API key toàn cục cho lệnh này. Để trống để dùng mặc định.
zh_hans: 可选：覆盖此命令的全局 API 密钥。留空则使用默认值。

source: Options
de: Optionen
es: Opciones
ja: オプション
vi: Tùy chọn
zh_hans: 选项

source: Organization ID (Optional)
de: Organisations-ID (optional)
es: ID de la organización (opcional)
fr: ID d'organisation (optionnel)
ja: 組織 ID（オプション）
vi: ID tổ chức (Tùy chọn)
zh_hans: 组织 ID（可选）

source: Original Developers
de: Ursprüngliche Entwickler
es: Desarrolladores originales
fr: Développeurs originaux
ja: オリジナル開発者
vi: Nhà phát triển gốc
zh_hans: 原始开发者

source: Output Format
de: Ausgabeformat
es: Formato de salida
fr: Format de sortie
ja: 出力形式
vi: Định dạng đầu ra
zh_hans: 输出格式

source: Override the default AI provider for this specific command
de: Überschreibe den standardmäßigen KI-Anbieter für diesen spezifischen Befehl.
es: Anula el proveedor de IA predeterminado para este comando específico.
fr: Remplacer le fournisseur d'IA par défaut pour cette commande spécifique.
ja: このコマンドのデフォルト AI プロバイダーを上書きします
vi: Ghi đè nhà cung cấp AI mặc định cho lệnh này
zh_hans: 覆盖此命令的默认 AI 提供商

source: Pause Hotkeys
de: Hotkeys pausieren
es: Pausar teclas de acceso rápido
fr: Mettre en pause les raccourcis
ja: ホットキーを一時停止
vi: Tạm dừng phím tắt
zh_hans: 暂停快捷键

source: Personality:
de: Persönlichkeit:
es: Personalidad:
fr: Personnalité :
ja: パーソナリティ:
vi: Tính cách:
zh_hans: 性格：

source: Preserve core message/meaning
de: Kernbotschaft/Bedeutung beibehalten
es: Conservar mensaje principal/contenido
fr: Conserver le message principal/le sens
ja: 核心的なメッセージ/意味を保持
vi: Giữ nguyên ý nghĩa cốt lõi
zh_hans: 保留核心意思/含义

source: Preserve essential information
de: Wesentliche Informationen beibehalten
es: Conservar información esencial
fr: Conserver les informations essentielles
ja: 重要な情報を保持
vi: Giữ nguyên thông tin thiết yếu
zh_hans: 保留重要信息

source: Preserve format
de: Format beibehalten
es: Conservar formato
fr: Conserver le format
ja: フォーマットを保持
vi: Giữ nguyên định dạng
zh_hans: 保留排版

source: Preserve formatting
de: Formatierung beibehalten
es: Conservar formato
fr: Conserver la mise en forme
ja: 書式を保持する
vi: Giữ nguyên định dạng
zh_hans: 保留格式

source: Preserve Options
de: Beibehalten-Optionen
es: Opciones de preservación
fr: Options de préservation
ja: 保持オプション
vi: Tùy chọn bảo toàn
zh_hans: 保留选项

source: Preserve style
de: Stil beibehalten
es: Conservar estilo
fr: Conserver le style
ja: スタイルを保持
vi: Giữ nguyên phong cách
zh_hans: 保留风格

source: Preserve tone
de: Ton beibehalten
es: Conservar tono
fr: Conserver le ton
ja: トーンを保持
vi: Giữ nguyên giọng văn
zh_hans: 保留语气

source: Preserves formatting for supported apps
de: Behält die Formatierung für unterstützte Apps bei
es: Conserva el formato para las aplicaciones compatibles.
fr: Préserve le formatage des applications prises en charge
ja: 対応アプリの書式を保持します
vi: Giữ nguyên định dạng cho các ứng dụng được hỗ trợ
zh_hans: 为支持的应用保留格式

source: Press your global shortcut to open the popup. Select text or images in any app and run a command. Built‑in commands are available and you can add your own.
de: Drücken Sie Ihre globale Tastenkombination, um das Popup-Fenster zu öffnen. Wählen Sie Text oder Bilder in einer beliebigen App aus und führen Sie einen Befehl aus. Es stehen integrierte Befehle zur Verfügung, und Sie können eigene hinzufügen.
es: Pulsa tu atajo global para abrir la ventana emergente. Selecciona texto o imágenes en cualquier aplicación y ejecuta un comando. Hay comandos integrados disponibles y puedes añadir los tuyos propios.
fr: Appuyez sur votre raccourci global pour ouvrir la fenêtre contextuelle. Sélectionnez du texte ou des images dans n'importe quelle application et exécutez une commande. Des commandes intégrées sont disponibles et vous pouvez ajouter les vôtres.
ja: グローバルショートカットを押してポップアップを開きます。任意のアプリでテキストや画像を選択してコマンドを実行します。組み込みコマンドが利用可能で、独自のコマンドも追加できます。
vi: Nhấn phím tắt toàn cục để mở popup. Chọn văn bản hoặc hình ảnh trong bất kỳ ứng dụng nào và chạy lệnh. Các lệnh tích hợp có sẵn và bạn có thể thêm lệnh của riêng mình.
zh_hans: 按全局快捷键打开弹出窗口。在任意应用中选择文字或图片并运行命令。内置命令已可使用，您也可以添加自定义命令。

source: Preview
de: Vorschau
es: Vista previa
fr: Aperçu
ja: プレビュー
vi: Xem trước
zh_hans: 预览
